src/InformationRegisters/БЗ_ДвоичныеДанныеФайлов/БЗ_ДвоичныеДанныеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_ДвоичныеДанныеФайлов</name>
  <resources>
    <name>ДвоичныеДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/РаботаСФайлами/Module.bsl
&Вместо("ХранилищеФайлаИзИнформационнойБазы")
Функция БЗ_ХранилищеФайлаИзИнформационнойБазы1(ФайлСсылка)
	
	Если ТипЗнч(ФайлСсылка) = Тип("СправочникСсылка.БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвоичныеДанныеФайлов.Файл,
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
		|ИЗ
		|	РегистрСведений.БЗ_ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл = &ФайлСсылка";
		
		Запрос.УстановитьПараметр("ФайлСсылка", ФайлСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Возврат ?(Выборка.Следующий(), Выборка.ДвоичныеДанныеФайла, Неопределено);
		
	Иначе
		Результат = ПродолжитьВызов(ФайлСсылка);
		Возврат Результат;
	КонецЕсли;
КонецФункции
